Revit 2027 API
Application.NewCurveArray Method
Creates an empty array that can store geometric curves.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveArray NewCurveArray()
Public Function NewCurveArray As CurveArray
public:
CurveArray^ NewCurveArray()
member NewCurveArray : unit -> CurveArray
Return Value
CurveArray
An empty array that can hold geometric curves.
Remarks
This method can be used to create an array that can hold any curve type object. This array can be then passed to methods, such as NewAreaLoad, to represent the geometry for the boundary of the load.
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace